dylad/RIOT/cpu/sam0_common/include_ng/periph_cpu_common.h
/*
 * SPDX-FileCopyrightText: 2016 Freie Universität Berlin
 * SPDX-License-Identifier: LGPL-2.1-only
 */

#pragma once

/**
 * @ingroup         cpu_sam0_common
 * @brief           Common CPU specific definitions for all SAMx21 based CPUs
 * @{
 *
 * @file
 * @brief           Common CPU specific definitions for all SAMx21 based CPUs
 *
 * @author          Hauke Petersen <hauke.petersen@fu-berlin.de>
 * @author          Dylan Laduranty <dylan.laduranty@mesotic.com>
 */

#include "cpu.h"
#include "exti_config.h"
#include "timer_config.h"

#ifdef __cplusplus
extern "C" {
#endif

/**
 * @brief   Length of the CPU_ID in octets
 */
#define CPUID_LEN           (16U)

/**
 * @brief   Use shared SPI functions
 * @{
 */
#define PERIPH_SPI_NEEDS_INIT_CS
#define PERIPH_SPI_NEEDS_TRANSFER_BYTE
#ifndef MODULE_PERIPH_DMA
#  define PERIPH_SPI_NEEDS_TRANSFER_REG
#  define PERIPH_SPI_NEEDS_TRANSFER_REGS
#endif
/** @} */

/**
 * @name   Use shared I2C functions
 * @{
 */
#define PERIPH_I2C_NEED_READ_REG
#define PERIPH_I2C_NEED_READ_REGS
#define PERIPH_I2C_NEED_WRITE_REG
#define PERIPH_I2C_NEED_WRITE_REGS
/** @} */

/**
 * @brief   Maximum bytes per frame for I2C operations
 */
#define PERIPH_I2C_MAX_BYTES_PER_FRAME 256

/**
 * @brief   Override GPIO type
 * @{
 */
#define HAVE_GPIO_T
typedef uint32_t gpio_t;
/** @} */

/**
 * @brief   Definition of a fitting UNDEF value
 */
#define GPIO_UNDEF          (0xffffffff)

/**
 * @brief   Macro for accessing GPIO pins
 * @{
 */
#ifdef MODULE_PERIPH_GPIO_FAST_READ
#  ifdef PORT_IOBUS_SEC
#    define GPIO_PIN(x, y)  (((gpio_t)(&PORT_IOBUS_SEC_REGS->Group[x])) | y)
#  else /* Use IOBUS access when available */
#    define GPIO_PIN(x, y)  (((gpio_t)(&PORT_IOBUS_REGS->Group[x])) | y)
#  endif /* PORT_IOBUS_SEC */
#else
#  ifdef PORT_SEC
#    define GPIO_PIN(x, y)  (((gpio_t)(&PORT_SEC_REGS->Group[x])) | y)
#  else
#    define GPIO_PIN(x, y)  (((gpio_t)(&PORT_REGS->Group[x])) | y)
#  endif /* PORT_IOBUS_SEC */
#endif

/**
 * @brief   Available ports on the SAMD21 & SAML21
 */
enum {
    PA = 0,                 /**< port A */
    PB = 1,                 /**< port B */
    PC = 2,                 /**< port C */
    PD = 3,                 /**< port D */
};

/**
 * @brief   Generate GPIO mode bitfields
 *
 * We use 3 bit to determine the pin functions:
 * - bit 0: PD(0) or PU(1)
 * - bit 1: input enable
 * - bit 2: pull enable
 */
#define GPIO_MODE(pr, ie, pe)   (pr | (ie << 1) | (pe << 2))

#ifndef DOXYGEN
/**
 * @brief   Override GPIO modes
 */
#  define HAVE_GPIO_MODE_T
typedef enum {
    GPIO_IN    = GPIO_MODE(0, 1, 0),    /**< IN */
    GPIO_IN_PD = GPIO_MODE(0, 1, 1),    /**< IN with pull-down */
    GPIO_IN_PU = GPIO_MODE(1, 1, 1),    /**< IN with pull-up */
    GPIO_OUT   = GPIO_MODE(0, 0, 0),    /**< OUT (push-pull) */
    GPIO_OD    = 0xfe,                  /**< not supported by HW */
    GPIO_OD_PU = 0xff                   /**< not supported by HW */
} gpio_mode_t;

#  define HAVE_GPIO_SLEW_T
typedef enum {
    GPIO_SLEW_SLOWEST = 0,
    GPIO_SLEW_SLOW = 0,
    GPIO_SLEW_FAST = 0,
    GPIO_SLEW_FASTEST = 0,
} gpio_slew_t;

#  define HAVE_GPIO_PULL_STRENGTH_T
typedef enum {
    GPIO_PULL_WEAKEST = 0,
    GPIO_PULL_WEAK = 0,
    GPIO_PULL_STRONG = 0,
    GPIO_PULL_STRONGEST = 0
} gpio_pull_strength_t;

#  define HAVE_GPIO_DRIVE_STRENGTH_T
typedef enum {
    GPIO_DRIVE_WEAKEST = 0,
    GPIO_DRIVE_WEAK = 0,
    GPIO_DRIVE_STRONG = 1,
    GPIO_DRIVE_STRONGEST = 1
} gpio_drive_strength_t;

#  define HAVE_GPIO_PULL_T
typedef enum {
    GPIO_FLOATING,
    GPIO_PULL_UP,
    GPIO_PULL_DOWN,
    GPIO_PULL_KEEP,
} gpio_pull_t;

#  define HAVE_GPIO_STATE_T
typedef enum {
    GPIO_OUTPUT_PUSH_PULL,
    GPIO_OUTPUT_OPEN_DRAIN,
    GPIO_OUTPUT_OPEN_SOURCE,
    GPIO_INPUT,
    GPIO_USED_BY_PERIPHERAL,
    GPIO_DISCONNECT,
} gpio_state_t;

#  define HAVE_GPIO_IRQ_TRIG_T
typedef enum {
    GPIO_TRIGGER_EDGE_RISING    = EIC_CONFIG_SENSE0_RISE_Val,
    GPIO_TRIGGER_EDGE_FALLING   = EIC_CONFIG_SENSE0_FALL_Val,
    GPIO_TRIGGER_EDGE_BOTH      = EIC_CONFIG_SENSE0_BOTH_Val,
    GPIO_TRIGGER_LEVEL_HIGH     = EIC_CONFIG_SENSE0_HIGH_Val,
    GPIO_TRIGGER_LEVEL_LOW      = EIC_CONFIG_SENSE0_LOW_Val,
} gpio_irq_trig_t;

#  define HAVE_GPIO_CONF_T
typedef union gpio_conf_sam0 gpio_conf_t;

/**
 * @brief   Override active flank configuration values
 * @{
 */
#  define HAVE_GPIO_FLANK_T
typedef enum {
    GPIO_FALLING = 2,       /**< emit interrupt on falling flank */
    GPIO_RISING = 1,        /**< emit interrupt on rising flank */
    GPIO_BOTH = 3           /**< emit interrupt on both flanks */
} gpio_flank_t;
/** @} */
#endif /* ndef DOXYGEN */

/**
 * @brief       GPIO pin configuration for SAM0 MCUs
 * @ingroup     drivers_periph_gpio_ll
 */
union gpio_conf_sam0 {
    uint8_t bits;  /**< the raw bits */
    struct {
        /**
         * @brief   State of the pin
         */
        gpio_state_t state                      : 3;
        /**
         * @brief   Pull resistor configuration
         */
        gpio_pull_t pull                        : 2;
        /**
         * @brief   Drive strength of the GPIO
         *
         * @warning If the requested drive strength is not available, the
         *          closest fit supported will be configured instead.
         *
         * This value is ignored when @ref gpio_conf_sam0::state is configured
         * to @ref GPIO_INPUT or @ref GPIO_DISCONNECT.
         */
        gpio_drive_strength_t drive_strength    : 1;
        /**
         * @brief   Initial value of the output
         *
         * Ignored if @ref gpio_conf_sam0::state is set to @ref GPIO_INPUT or
         * @ref GPIO_DISCONNECT. If the pin was previously in a high impedance
         * state, it is guaranteed to directly transition to the given initial
         * value.
         *
         * @ref gpio_ll_query_conf will write the current value of the specified
         * pin here, which is read from the input register when the state is
         * @ref GPIO_INPUT, otherwise the state from the output register is
         * consulted.
         */
        bool initial_value                      : 1;
        uint8_t                                 : 1; /**< padding */
    };
};

/**
 * @brief   Available MUX values for configuring a pin's alternate function
 */
#ifndef SAM_MUX_T
typedef enum {
    GPIO_MUX_A = 0x0,       /**< select peripheral function A */
    GPIO_MUX_B = 0x1,       /**< select peripheral function B */
    GPIO_MUX_C = 0x2,       /**< select peripheral function C */
    GPIO_MUX_D = 0x3,       /**< select peripheral function D */
    GPIO_MUX_E = 0x4,       /**< select peripheral function E */
    GPIO_MUX_F = 0x5,       /**< select peripheral function F */
    GPIO_MUX_G = 0x6,       /**< select peripheral function G */
    GPIO_MUX_H = 0x7,       /**< select peripheral function H */
    GPIO_MUX_I = 0x8,       /**< select peripheral function I */
    GPIO_MUX_J = 0x9,       /**< select peripheral function J */
    GPIO_MUX_K = 0xa,       /**< select peripheral function K */
    GPIO_MUX_L = 0xb,       /**< select peripheral function L */
    GPIO_MUX_M = 0xc,       /**< select peripheral function M */
    GPIO_MUX_N = 0xd,       /**< select peripheral function N */
    GPIO_MUX_DISABLED = 0xff, /**< Disable  */
} gpio_mux_t;
#endif

/**
 * @brief   Available values for SERCOM UART RX pad selection
 */
typedef enum {
    UART_PAD_RX_0 = 0x0,    /**< use pad 0 for RX line */
    UART_PAD_RX_1 = 0x1,    /**< select pad 1 */
    UART_PAD_RX_2 = 0x2,    /**< select pad 2 */
    UART_PAD_RX_3 = 0x3,    /**< select pad 3 */
} uart_rxpad_t;

/**
 * @brief   Available values for SERCOM UART TX pad selection
 */
typedef enum {
    UART_PAD_TX_0             = 0x0,    /**< select pad 0 */
    UART_PAD_TX_2             = 0x1,    /**< select pad 2 */
    UART_PAD_TX_0_RTS_2_CTS_3 = 0x2,    /**< TX is pad 0, on top RTS on pad 2
                                         *   and CTS on pad 3 */
} uart_txpad_t;

/**
 * @brief   Available SERCOM UART flag selections
 */
typedef enum {
    UART_FLAG_NONE            = 0x0,    /**< No flags set */
    UART_FLAG_RUN_STANDBY     = 0x1,    /**< run SERCOM in standby mode */
    UART_FLAG_WAKEUP          = 0x2,    /**< wake from sleep on receive */
    UART_FLAG_TX_ONDEMAND     = 0x4,    /**< Only enable TX pin on demand */
} uart_flag_t;

#ifndef DOXYGEN
/**
 * @brief   Available SERCOM UART data size selections
 *
 * 9 bit UART mode is currently unavailable as it is not supported by the common
 * RIOT UART peripheral API.
 * @{
 */
#  define HAVE_UART_DATA_BITS_T
typedef enum {
    UART_DATA_BITS_5 = 0x5,   /**< 5 data bits */
    UART_DATA_BITS_6 = 0x6,   /**< 6 data bits */
    UART_DATA_BITS_7 = 0x7,   /**< 7 data bits */
    UART_DATA_BITS_8 = 0x0,   /**< 8 data bits */
} uart_data_bits_t;
/** @} */

/**
 * @brief   UART pin getters
 * @{
 */
#  define uart_pin_rx(dev) uart_config[dev].rx_pin
#  define uart_pin_tx(dev) uart_config[dev].tx_pin
/** @} */

#endif /* ndef DOXYGEN */

/**
 * @brief   Size of the UART TX buffer for non-blocking mode.
 */
#ifndef UART_TXBUF_SIZE
#  define UART_TXBUF_SIZE  (64)
#endif

/**
 * @brief   UART device configuration
 *
 *          The frequency f() of the clock `gclk_src` must fulfill the condition
 *
 *              16 * baud < f(gclk_src) ≤ 2²⁰ * baud
 *
 *          in Asynchronous Arithmetic mode and
 *
 *              16 * baud < f(gclk_src) ≤ 2¹⁷ * baud
 *
 *          in Asynchronous Fractional mode
 */
typedef struct {
    sercom_registers_t *dev;  /**< pointer to the used UART device */
    gpio_t rx_pin;                  /**< pin used for RX */
    gpio_t tx_pin;                  /**< pin used for TX */
    #ifdef MODULE_PERIPH_UART_HW_FC
    gpio_t rts_pin;                 /**< pin used for RTS */
    gpio_t cts_pin;                 /**< pin used for CTS */
    #endif
    gpio_mux_t mux;                 /**< alternative function for pins */
    uart_rxpad_t rx_pad;            /**< pad selection for RX line */
    uart_txpad_t tx_pad;            /**< pad selection for TX line */
    uart_flag_t flags;              /**< set optional SERCOM flags */
    uint8_t gclk_src;               /**< GCLK source which supplys SERCOM */
} uart_conf_t;

enum {
    TIMER_TYPE_TC,          /**< Timer is a TC timer  */
    TIMER_TYPE_TCC,         /**< Timer is a TCC timer */
};

/**
 * @brief   Common configuration for timer devices
 */
typedef struct {
    union {
#ifdef REV_TC
        Tc *tc;                 /**< TC device to use */
#endif
#ifdef REV_TCC
        Tcc *tcc;               /**< TCC device to use */
#endif
    } dev;                      /**< The Timer device used for PWM */
#ifdef MCLK
    volatile uint32_t *mclk;    /**< Pointer to MCLK_REGS->APBxMASK */
    uint32_t mclk_mask;         /**< MCLK_APBxMASK bits to enable Timer */
#else
    uint32_t pm_mask;           /**< PM_APBCMASK bits to enable Timer */
#endif
    uint16_t gclk_id;           /**< TCn_GCLK_ID */
    uint8_t type;               /**< Timer type (TC/TCC) */
} tc_tcc_cfg_t;

/**
 * @brief   Static initializer for TC timer configuration
 */
#ifdef MCLK
#  define TC_CONFIG(tim)                  { \
        .dev       = {.tc = tim},           \
        .mclk      = MCLK_ ## tim,          \
        .mclk_mask = MCLK_ ## tim ## _MASK, \
        .gclk_id   = tim ## _GCLK_ID,       \
        .type      = TIMER_TYPE_TC,       }
#else
#  define TC_CONFIG(tim)                  { \
        .dev       = {.tc = tim},           \
        .pm_mask   = PM_APBCMASK_ ## tim,   \
        .gclk_id   = tim ## _GCLK_ID,       \
        .type      = TIMER_TYPE_TC,       }
#endif

/**
 * @brief   Static initializer for TCC timer configuration
 */
#ifdef MCLK
#  define TCC_CONFIG(tim)                 { \
        .dev       = {.tcc = tim},          \
        .mclk      = MCLK_ ## tim,          \
        .mclk_mask = MCLK_ ## tim ## _MASK, \
        .gclk_id   = tim ## _GCLK_ID,       \
        .type      = TIMER_TYPE_TCC,      }
#else
#  define TCC_CONFIG(tim)                 { \
        .dev       = {.tcc = tim},          \
        .pm_mask   = PM_APBCMASK_ ## tim,   \
        .gclk_id   = tim ## _GCLK_ID,       \
        .type      = TIMER_TYPE_TCC,      }
#endif

/**
 * @brief   PWM channel configuration data structure
 */
typedef struct {
    gpio_t pin;             /**< GPIO pin */
    gpio_mux_t mux;         /**< pin function multiplex value */
    uint8_t chan;           /**< TCC channel to use */
} pwm_conf_chan_t;

/**
 * @brief   PWM device configuration data structure
 */
typedef struct {
    tc_tcc_cfg_t tim;               /**< timer configuration */
    const pwm_conf_chan_t *chan;    /**< channel configuration */
    uint8_t chan_numof;             /**< number of channels */
    uint8_t gclk_src;               /**< GCLK source which clocks TIMER */
} pwm_conf_t;

/**
 * @brief   Available values for SERCOM SPI MISO pad selection
 */
typedef enum {
    SPI_PAD_MISO_0 = 0x0,       /**< use pad 0 for MISO line */
    SPI_PAD_MISO_1 = 0x1,       /**< use pad 1 for MISO line */
    SPI_PAD_MISO_2 = 0x2,       /**< use pad 2 for MISO line */
    SPI_PAD_MISO_3 = 0x3,       /**< use pad 3 for MISO line */
} spi_misopad_t;

/**
 * @brief   Available values for SERCOM SPI MOSI and SCK pad selection
 */
typedef enum {
    SPI_PAD_MOSI_0_SCK_1 = 0x0, /**< use pad 0 for MOSI, pad 1 for SCK */
    SPI_PAD_MOSI_2_SCK_3 = 0x1, /**< use pad 2 for MOSI, pad 3 for SCK */
    SPI_PAD_MOSI_3_SCK_1 = 0x2, /**< use pad 3 for MOSI, pad 1 for SCK */
    SPI_PAD_MOSI_0_SCK_3 = 0x3, /**< use pad 0 for MOSI, pad 3 for SCK */
} spi_mosipad_t;

#ifndef DOXYGEN
/**
 * @brief   Override SPI modes
 * @{
 */
#  define HAVE_SPI_MODE_T
typedef enum {
    SPI_MODE_0 = 0x0,       /**< CPOL=0, CPHA=0 */
    SPI_MODE_1 = 0x1,       /**< CPOL=0, CPHA=1 */
    SPI_MODE_2 = 0x2,       /**< CPOL=1, CPHA=0 */
    SPI_MODE_3 = 0x3        /**< CPOL=1, CPHA=1 */
} spi_mode_t;
/** @} */

/**
 * @brief   Override SPI clock speed values
 * @{
 */
#  define HAVE_SPI_CLK_T
typedef enum {
    SPI_CLK_100KHZ =   100000U, /**< drive the SPI bus with 100KHz */
    SPI_CLK_400KHZ =   400000U, /**< drive the SPI bus with 400KHz */
    SPI_CLK_1MHZ   =  1000000U, /**< drive the SPI bus with 1MHz */
    SPI_CLK_5MHZ   =  5000000U, /**< drive the SPI bus with 5MHz */
    SPI_CLK_10MHZ  = 10000000U  /**< drive the SPI bus with 10MHz */
} spi_clk_t;
/** @} */

/**
 * @brief   SPI pin getters
 * @{
 */
#  define spi_pin_mosi(dev) spi_config[dev].mosi_pin
#  define spi_pin_miso(dev) spi_config[dev].miso_pin
#  define spi_pin_clk(dev)  spi_config[dev].clk_pin
/** @} */

#endif /* ndef DOXYGEN */

/**
 * @brief   SPI device configuration
 */
typedef struct {
    void *dev;              /**< pointer to the used SPI device */
    gpio_t miso_pin;        /**< used MISO pin */
    gpio_t mosi_pin;        /**< used MOSI pin */
    gpio_t clk_pin;         /**< used CLK pin */
    gpio_mux_t miso_mux;    /**< alternate function for MISO pin (mux) */
    gpio_mux_t mosi_mux;    /**< alternate function for MOSI pin (mux) */
    gpio_mux_t clk_mux;     /**< alternate function for CLK pin (mux) */
    spi_misopad_t miso_pad; /**< pad to use for MISO line */
    spi_mosipad_t mosi_pad; /**< pad to use for MOSI and CLK line */
    uint8_t gclk_src;       /**< GCLK source which supplys SERCOM */
#ifdef MODULE_PERIPH_DMA
    uint8_t tx_trigger;     /**< DMA trigger */
    uint8_t rx_trigger;     /**< DMA trigger */
#endif
} spi_conf_t;
/** @} */

/**
 * @brief   Available SERCOM I2C flag selections
 */
typedef enum {
    I2C_FLAG_NONE            = 0x0,    /**< No flags set */
    I2C_FLAG_RUN_STANDBY     = 0x1,    /**< run SERCOM in standby mode */
} i2c_flag_t;

#ifndef DOXYGEN
/**
 * @name    Override I2C clock speed values
 * @{
 */
#  define HAVE_I2C_SPEED_T
typedef enum {
    I2C_SPEED_LOW       = 10000U,      /**< low speed mode:    ~10kbit/s */
    I2C_SPEED_NORMAL    = 100000U,     /**< normal mode:       ~100kbit/s */
    I2C_SPEED_FAST      = 400000U,     /**< fast mode:         ~400kbit/s */
    I2C_SPEED_FAST_PLUS = 1000000U,    /**< fast plus mode:    ~1Mbit/s */
    I2C_SPEED_HIGH      = 3400000U,    /**< high speed mode:   ~3.4Mbit/s */
} i2c_speed_t;
/** @} */

/**
 * @name    I2C pin getter functions
 * @{
 */
#  define i2c_pin_sda(dev) i2c_config[dev].sda_pin
#  define i2c_pin_scl(dev) i2c_config[dev].scl_pin
/** @} */

#endif /* ndef DOXYGEN */

/**
 * @brief   I2C device configuration
 *          The frequency f() of the clock `gclk_src` must fulfill the condition
 *
 *              4 * speed ≤ f(gclk_src) ≤ 512 * speed
 *
 *          if speed ≤ 1 MHz and
 *
 *             12 * speed ≤ f(gclk_src) ≤ 520 * speed
 *
 *          if speed > 1 MHz
 */
typedef struct {
    sercom_i2cm_registers_t *dev;   /**< pointer to the used I2C device */
    i2c_speed_t speed;              /**< baudrate used for the bus */
    gpio_t scl_pin;                 /**< used SCL pin */
    gpio_t sda_pin;                 /**< used MOSI pin */
    gpio_mux_t mux;                 /**< alternate function (mux) */
    uint8_t gclk_src;               /**< GCLK source which supplys SERCOM */
    uint8_t flags;                  /**< allow SERCOM to run in standby mode */
} i2c_conf_t;

/**
 * @brief   Timer device configuration
 */
typedef struct {
    tc_count32_registers_t *dev;    /**< pointer to the used Timer device */
    IRQn_Type irq;                  /**< IRQ# of Timer Interrupt */
#ifdef MCLK
    volatile uint32_t *mclk;        /**< Pointer to MCLK_REGS->APBxMASK */
    uint32_t mclk_mask;             /**< MCLK_APBxMASK bits to enable Timer */
    uint16_t gclk_id;               /**< TCn_GCLK_ID */
#else
    uint32_t pm_mask;               /**< PM_APBCMASK bits to enable Timer */
    uint16_t gclk_ctrl;             /**< GCLK_CLKCTRL_ID for the Timer */
#endif
    uint8_t gclk_src;               /**< GCLK source which supplys Timer */
    uint16_t flags;                 /**< flags for CTRA, e.g. TC_CTRLA_MODE_COUNT32 */
} tc32_conf_t;

/**
 * @brief   Number of available timer channels
 */
#define TIMER_CHANNEL_NUMOF (2)

/**
 * @brief   Set up alternate function (PMUX setting) for a PORT pin
 *
 * @param[in] pin   Pin to set the multiplexing for
 * @param[in] mux   Mux value
 */
void gpio_init_mux(gpio_t pin, gpio_mux_t mux);

